# DWFImportOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWFImportOptions Properties
DWFImportOptions Class See Also
---
The DWFImportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DWFImportOptions Class
Autodesk.Revit.DB Namespace